// Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.

Console.Clear();
Console.Write("Введите первое число: ");
int day_week = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите первое число: ");
int num2 = Convert.ToInt32(Console.ReadLine());
int res = num2*num2;
if (num1==res)
{
    Console.Write("Первое число не является квадратом второго");
}
else
{
    Console.Write("Первое число не является квадратом второго");
}