// Напишите программу, которая будет выдавать название дня недели по заданному номеру.

Console.Clear();
Console.Write("Введите номер дня недели: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите первое число: ");
int num2 = Convert.ToInt32(Console.ReadLine());
int res = num2*num2;
if (num1==res)
{
    Console.Write("Первое число не является квадратом второго");
}
else
{
    Console.Write("Первое число не является квадратом второго");
}
Console.WriteLine();